Masmiseim36/nxpSDK/boards/mimxrt700evk/dsp_examples/xaf_playback/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31, input_buffer: enable}
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0, input_buffer: disable}
  - {pin_num: J1, peripheral: SAI0, signal: RX_BCLK, pin_signal: PIO0_0, input_buffer: enable}
  - {pin_num: J2, peripheral: SAI0, signal: RX_SYNC, pin_signal: PIO0_1, input_buffer: enable}
  - {pin_num: J3, peripheral: SAI0, signal: RXD0, pin_signal: PIO0_2, input_buffer: enable}
  - {pin_num: J4, peripheral: SAI0, signal: TX_BCLK, pin_signal: PIO0_3, input_buffer: enable}
  - {pin_num: K4, peripheral: SAI0, signal: TXD0, pin_signal: PIO0_4, input_buffer: enable}
  - {pin_num: K3, peripheral: SAI0, signal: TX_SYNC, pin_signal: PIO0_5, input_buffer: enable}
  - {pin_num: R2, peripheral: LP_FLEXCOMM2, signal: P0, pin_signal: PIO1_11, open_drain: enable, input_buffer: enable}
  - {pin_num: R1, peripheral: LP_FLEXCOMM2, signal: P1, pin_signal: PIO1_12, open_drain: enable, input_buffer: enable}
  - {pin_num: M2, peripheral: CLKCTL0, signal: MCLK, pin_signal: PIO0_21, selects_transmitter_current_drive: O_33, input_buffer: enable}
  - {pin_num: G12, peripheral: USDHC1, signal: CARD_DET_N, pin_signal: PIO7_24, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: L17, peripheral: USDHC1, signal: CLK, pin_signal: PIO7_17, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: L16, peripheral: USDHC1, signal: CMD, pin_signal: PIO7_18, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: M17, peripheral: USDHC1, signal: 'DATA, 0', pin_signal: PIO7_19, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: M18, peripheral: USDHC1, signal: 'DATA, 1', pin_signal: PIO7_20, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: K18, peripheral: USDHC1, signal: 'DATA, 2', pin_signal: PIO7_21, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: K17, peripheral: USDHC1, signal: 'DATA, 3', pin_signal: PIO7_22, selects_transmitter_current_drive: O_33, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: C5, peripheral: GPIO7, signal: 'GPIO, 11', pin_signal: PIO7_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t port0_pin0_config = (/* Pin is configured as SAI0_RX_BCLK */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN0 (coords: J1) is configured as SAI0_RX_BCLK */
    IOPCTL_PinMuxSet(0U, 0U, port0_pin0_config);

    const uint32_t port0_pin1_config = (/* Pin is configured as SAI0_RX_SYNC */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN1 (coords: J2) is configured as SAI0_RX_SYNC */
    IOPCTL_PinMuxSet(0U, 1U, port0_pin1_config);

    const uint32_t port0_pin2_config = (/* Pin is configured as SAI0_RX_DATA */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN2 (coords: J3) is configured as SAI0_RX_DATA */
    IOPCTL_PinMuxSet(0U, 2U, port0_pin2_config);

    const uint32_t port0_pin21_config = (/* Pin is configured as CLKCTL0_MCLK */
                                         IOPCTL_PIO_FUNC6 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 33ohm */
                                         IOPCTL_PIO_DRIVE_33OHM);
    /* PORT0 PIN21 (coords: M2) is configured as CLKCTL0_MCLK */
    IOPCTL_PinMuxSet(0U, 21U, port0_pin21_config);

    const uint32_t port0_pin3_config = (/* Pin is configured as SAI0_TX_BCLK */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN3 (coords: J4) is configured as SAI0_TX_BCLK */
    IOPCTL_PinMuxSet(0U, 3U, port0_pin3_config);

    const uint32_t port0_pin31_config = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: N4) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(0U, 31U, port0_pin31_config);

    const uint32_t port0_pin4_config = (/* Pin is configured as SAI0_TX_DATA */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN4 (coords: K4) is configured as SAI0_TX_DATA */
    IOPCTL_PinMuxSet(0U, 4U, port0_pin4_config);

    const uint32_t port0_pin5_config = (/* Pin is configured as SAI0_TX_SYNC */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN5 (coords: K3) is configured as SAI0_TX_SYNC */
    IOPCTL_PinMuxSet(0U, 5U, port0_pin5_config);

